import 'package:flutter_chat/components/post_list_tile.dart';

List<PostListTile> postsList = [
  PostListTile(
      userName: "Meida",
      data:
          "Сегодня у Мейды был насыщенный день. Она проснулась рано утром и сразу же села за свою работу - редактирование видео. Потом у нее был долгий сеанс записи видео и съемки, после которого она еще долго просматривала отснятый материал и выбирала сцены для монтажа. На обеде она быстро перекусила и потом отправилась на фотосессию для нового видео. Во второй половине дня она закончила редактирование и наконец-то отправилась отдохнуть, немного посмотрев любимую серию и пообщавшись со своими подписчиками "),
  PostListTile(
      userName: "Hecker",
      data:
          "Сегодня у хекера был насыщенный день. Он проснулся рано утром, чтобы начать работать над своим новым проектом в области технологии. Всю первую половину дня он провел за компьютером, кодируя и тестируя различные алгоритмы и программы. Потом ему пришлось отправится на встречу с клиентами, обсудить с ними новую задачу и распланировать проект. Во второй половине дня он снова взялся за код и работал до поздней ночи, пытаясь закончить проект к следующему дню"),
  PostListTile(
      userName: "SiroChan",
      data:
          "Сегодня у Сырочана был день, как обычно, насыщенный и продуктивный. Он проснулся утром, отправился в свою студию и начал работать над видео для YouTube. Всю первую половину дня он снимал новое видео для своего канала, редактировал изображения и подбирал музыку. Во второй половине дня он продолжил работать над своим новым проектом на ноутбуке и ответил на несколько сообщений от своих подписчиков"),
  PostListTile(
      userName: "Vla",
      data:
          "Сегодня у Вилы был довольно насыщенный день. Утром она проснулась рано и отправилась в студию, чтобы начать работать над новым видео для своего канала. Она снимала и редактировала видео на протяжении всего утра и половины дня. Во второй половине дня она отправилась на прогулку, чтобы проветрить голову и подумать над следующим проектом."),
];
